modm-ext/data.modm.io/docs/svd/header_stm32f373xc.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>Reset and Clock Control</description>
      <groupName>RCC</groupName>
      <baseAddress>0x40021000</baseAddress>
      <interrupt>
        <name>RCC</name>
        <description>RCC global Interrupt</description>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>RCC clock control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HSION</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDY</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSITRIM</name>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>HSICAL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HSEON</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDY</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEBYP</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSON</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLON</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLRDY</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <description>RCC clock configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SW</name>
              <description>SW[1:0] bits (System clock Switch)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI selection as system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE selection as system clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>PLL selection as system clock</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWS</name>
              <description>SWS[1:0] bits (System Clock Switch Status)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI used as system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE used as system clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>PLL used as system clock</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPRE</name>
              <description>HPRE[3:0] bits (AHB prescaler)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>SYSCLK not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>SYSCLK divided by 2</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>SYSCLK divided by 4</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>SYSCLK divided by 8</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>SYSCLK divided by 16</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_64</name>
                  <description>SYSCLK divided by 64</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_128</name>
                  <description>SYSCLK divided by 128</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_256</name>
                  <description>SYSCLK divided by 256</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_512</name>
                  <description>SYSCLK divided by 512</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPRE1</name>
              <description>PRE1[2:0] bits (APB1 prescaler)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>HCLK not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>HCLK divided by 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>HCLK divided by 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>HCLK divided by 8</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>HCLK divided by 16</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPRE2</name>
              <description>PRE2[2:0] bits (APB2 prescaler)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>HCLK not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>HCLK divided by 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>HCLK divided by 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>HCLK divided by 8</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>HCLK divided by 16</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCPRE</name>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>ADC prescaler PCLK divided by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>ADC prescaler PCLK divided by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <description>ADC prescaler PCLK divided by 6</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>ADC prescaler PCLK divided by 8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLSRC</name>
              <description>PLL entry clock source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No clock selected as main PLL entry clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE/PREDIV clock selected as PLL entry clock source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLXTPRE</name>
              <description>HSE divider for PLL entry</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLMUL</name>
              <description>PLLMUL[3:0] bits (PLL multiplication factor)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUL_2</name>
                  <description>PLL input clock*2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_3</name>
                  <description>PLL input clock*3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_4</name>
                  <description>PLL input clock*4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_5</name>
                  <description>PLL input clock*5</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_6</name>
                  <description>PLL input clock*6</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_7</name>
                  <description>PLL input clock*7</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_8</name>
                  <description>PLL input clock*8</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_9</name>
                  <description>PLL input clock*9</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_10</name>
                  <description>PLL input clock*10</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_11</name>
                  <description>PLL input clock*11</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_12</name>
                  <description>PLL input clock*12</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_13</name>
                  <description>PLL input clock*13</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_14</name>
                  <description>PLL input clock*14</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_15</name>
                  <description>PLL input clock*15</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUL_16</name>
                  <description>PLL input clock*16</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBPRE</name>
              <description>USB prescaler</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>USB prescaler is PLL clock divided by 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1_5</name>
                  <description>USB prescaler is PLL clock divided by 1.5</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCO</name>
              <description>MCO[2:0] bits (Microcontroller Clock Output)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SDPRE</name>
              <description>SDPRE[4:0] bits (Sigma Delta ADC prescaler)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>SDADC CLK not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>SDADC CLK divided by 2</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>SDADC CLK divided by 4</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <description>SDADC CLK divided by 6</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>SDADC CLK divided by 8</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_10</name>
                  <description>SDADC CLK divided by 10</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_12</name>
                  <description>SDADC CLK divided by 12</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_14</name>
                  <description>SDADC CLK divided by 14</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>SDADC CLK divided by 16</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_20</name>
                  <description>SDADC CLK divided by 20</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_24</name>
                  <description>SDADC CLK divided by 24</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_28</name>
                  <description>SDADC CLK divided by 28</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_32</name>
                  <description>SDADC CLK divided by 32</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_36</name>
                  <description>SDADC CLK divided by 36</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_40</name>
                  <description>SDADC CLK divided by 40</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_44</name>
                  <description>SDADC CLK divided by 44</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_48</name>
                  <description>SDADC CLK divided by 48</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIR</name>
          <description>RCC clock interrupt register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <description>LSI Ready Interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSERDYF</name>
              <description>LSE Ready Interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDYF</name>
              <description>HSI Ready Interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDYF</name>
              <description>HSE Ready Interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLRDYF</name>
              <description>PLL Ready Interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSF</name>
              <description>Clock Security System Interrupt flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSIRDYIE</name>
              <description>LSI Ready Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>LSE Ready Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>HSI Ready Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>HSE Ready Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <description>PLL Ready Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSIRDYC</name>
              <description>LSI Ready Interrupt Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSERDYC</name>
              <description>LSE Ready Interrupt Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDYC</name>
              <description>HSI Ready Interrupt Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDYC</name>
              <description>HSE Ready Interrupt Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLRDYC</name>
              <description>PLL Ready Interrupt Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSC</name>
              <description>Clock Security System Interrupt Clear</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
